In [1]:
import pandas as pd
import numpy as np

![](figures/pandasanatomy.png)

In [2]:
population_dict = {'Califonia':38000000,
                 'Texas':26444423,
                 'New York': 19651127,
                 'Florida': 19552860,
                 'Illinois': 12882135}

In [3]:
population = pd.Series(population_dict)
population

Califonia    38000000
Texas        26444423
New York     19651127
Florida      19552860
Illinois     12882135
dtype: int64

In [4]:
population['Califonia']

38000000

In [5]:
population['Califonia':'Florida']

Califonia    38000000
Texas        26444423
New York     19651127
Florida      19552860
dtype: int64

In [6]:
S = pd.Series([2,4,6])
S

0    2
1    4
2    6
dtype: int64

In [7]:
S = pd.Series(5, index=[100,200,300])
S

100    5
200    5
300    5
dtype: int64

In [8]:
S[200]

5

In [9]:
S = pd.Series({2:'a', 1:'b', 3:'c', 3:'d'})
S

2    a
1    b
3    d
dtype: object

In [10]:
S[3]

'd'

In [11]:
area_dict = {'Califonia':429677,
                 'Texas':695627,
                 'New York': 141297,
                 'Florida': 170312,
                 'Illinois': 128821}

In [12]:
area = pd.Series(area_dict)
area

Califonia    429677
Texas        695627
New York     141297
Florida      170312
Illinois     128821
dtype: int64

In [13]:
population

Califonia    38000000
Texas        26444423
New York     19651127
Florida      19552860
Illinois     12882135
dtype: int64

In [14]:
states = pd.DataFrame({'population':population, 'area':area})

In [15]:
states

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [16]:
states.index

Index(['Califonia', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [17]:
states.columns

Index(['population', 'area'], dtype='object')

In [18]:
states['area']

Califonia    429677
Texas        695627
New York     141297
Florida      170312
Illinois     128821
Name: area, dtype: int64

In [19]:
states.loc['Califonia':'Florida']

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312

In [20]:
states.population

Califonia    38000000
Texas        26444423
New York     19651127
Florida      19552860
Illinois     12882135
Name: population, dtype: int64

In [21]:
states['area']

Califonia    429677
Texas        695627
New York     141297
Florida      170312
Illinois     128821
Name: area, dtype: int64

In [22]:
states['area']['Califonia':'Florida'] # 자르기

Califonia    429677
Texas        695627
New York     141297
Florida      170312
Name: area, dtype: int64

In [23]:
states.head(2)

           population    area
Califonia    38000000  429677
Texas        26444423  695627

In [24]:
states.tail(2)

          population    area
Florida     19552860  170312
Illinois    12882135  128821

In [25]:
states['density'] =states.population/states.area
states

           population    area     density
Califonia    38000000  429677   88.438525
Texas        26444423  695627   38.015234
New York     19651127  141297  139.076746
Florida      19552860  170312  114.806121
Illinois     12882135  128821  100.000272

In [26]:
states.drop('density', 1, inplace=True)

In [27]:
states

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [28]:
states

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [29]:
states[['population','area']]

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [30]:
states[0:1]

           population    area
Califonia    38000000  429677

In [31]:
states.iloc[:100,:3]

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [32]:
states.loc[:'Illinois', :'area']

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [33]:
states.loc[:'Illinois', ['population','density']]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [ ]:
subset = states.loc[states.density>100]

In [ ]:
subset.to_csv('states_subset.csv')